#Тест 1
#Входные данные:
#Harry

#Вывод программы:
#Hello, Harry!

name = input()
print('Hello, ', name, '!', sep = '')
